documentation.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-11-03 Wed 08:57 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>MongoDB</title>
<meta name="author" content="Tooraj Taraz" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">MongoDB</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org3fad2f7">1. MongoDB</a>
<ul>
<li><a href="#org6638401">1.1. MySQL to Mongo Lang!</a>
<ul>
<li><a href="#orgedc991c">1.1.1. Table/Collection creation</a></li>
<li><a href="#org80e357f">1.1.2. Insertion</a></li>
<li><a href="#org19b53a3">1.1.3. Queries</a></li>
</ul>
</li>
<li><a href="#orgdf040d8">1.2. How to install?</a>
<ul>
<li><a href="#org5e7b9db">1.2.1. Headless windows server</a></li>
<li><a href="#orgfa36cb9">1.2.2. Centos 8</a></li>
<li><a href="#org20cbf50">1.2.3. Ubuntu 20.04</a></li>
<li><a href="#orgc00649e">1.2.4. Starting mongo&rsquo;s service (Ubuntu and Centos)</a></li>
</ul>
</li>
<li><a href="#org8952888">1.3. How to automate this process?</a></li>
<li><a href="#orgbe00bf7">1.4. How to setup or database?</a>
<ul>
<li><a href="#orgd63a031">1.4.1. Creating a new user with admin access</a></li>
<li><a href="#org6e3e2ac">1.4.2. Creating a new database</a></li>
<li><a href="#orgdc9e1e4">1.4.3. Connecting to our database</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org3fad2f7" class="outline-2">
<h2 id="org3fad2f7"><span class="section-number-2">1.</span> MongoDB</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org6638401" class="outline-3">
<h3 id="org6638401"><span class="section-number-3">1.1.</span> MySQL to Mongo Lang!</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-orgedc991c" class="outline-4">
<h4 id="orgedc991c"><span class="section-number-4">1.1.1.</span> Table/Collection creation</h4>
<div class="outline-text-4" id="text-1-1-1">
<div class="org-src-container">
<pre class="src src-js">db.people.insertOne( {
    user_id: <span style="color: #98be65;">"abc123"</span>,
    age: <span style="color: #da8548; font-weight: bold;">55</span>,
    status: <span style="color: #98be65;">"A"</span>
 } )
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sql"><span style="color: #51afef;">CREATE</span> <span style="color: #51afef;">TABLE</span> <span style="color: #c678dd;">people</span> (
    id MEDIUMINT <span style="color: #51afef;">NOT</span> <span style="color: #51afef;">NULL</span>
        AUTO_INCREMENT,
    user_id <span style="color: #ECBE7B;">Varchar</span>(<span style="color: #da8548; font-weight: bold;">30</span>),
    age <span style="color: #51afef;">Number</span>,
    status <span style="color: #ECBE7B;">char</span>(<span style="color: #da8548; font-weight: bold;">1</span>),
    <span style="color: #51afef;">PRIMARY</span> <span style="color: #51afef;">KEY</span> (id)
)
</pre>
</div>
</div>
</div>
<div id="outline-container-org80e357f" class="outline-4">
<h4 id="org80e357f"><span class="section-number-4">1.1.2.</span> Insertion</h4>
<div class="outline-text-4" id="text-1-1-2">
<div class="org-src-container">
<pre class="src src-js">db.people.insertOne({
    user_id: <span style="color: #98be65;">"bcd001"</span>,
    age: <span style="color: #da8548; font-weight: bold;">45</span>, status: <span style="color: #98be65;">"A"</span>
})
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sql"><span style="color: #51afef;">INSERT</span> <span style="color: #51afef;">INTO</span> people(user_id,
                  age,
                  status
                  )
<span style="color: #51afef;">VALUES</span> ("bcd001",
        <span style="color: #da8548; font-weight: bold;">45</span>,
        "A"
       )
</pre>
</div>
</div>
</div>
<div id="outline-container-org19b53a3" class="outline-4">
<h4 id="org19b53a3"><span class="section-number-4">1.1.3.</span> Queries</h4>
<div class="outline-text-4" id="text-1-1-3">
<div class="org-src-container">
<pre class="src src-js">db.people.find({
    status: <span style="color: #98be65;">"A"</span>
}).sort({
    user_id: -<span style="color: #da8548; font-weight: bold;">1</span>
})
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sql"><span style="color: #51afef;">SELECT</span> *
<span style="color: #51afef;">FROM</span> people
<span style="color: #51afef;">WHERE</span> status = "A"
<span style="color: #51afef;">ORDER</span> <span style="color: #51afef;">BY</span> user_id <span style="color: #51afef;">DESC</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgdf040d8" class="outline-3">
<h3 id="orgdf040d8"><span class="section-number-3">1.2.</span> How to install?</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org5e7b9db" class="outline-4">
<h4 id="org5e7b9db"><span class="section-number-4">1.2.1.</span> Headless windows server</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
You can find whatever you are going to need in the link below, You also can use notes provided after the link!
</p>
<ul class="org-ul">
<li><a href="https://community.chocolatey.org/packages/mongodb">https://community.chocolatey.org/packages/mongodb</a></li>
</ul>

<p>
Using this line of code you can install chocolatey package manager on your server:
</p>
<div class="org-src-container">
<pre class="src src-shell">Set-ExecutionPolicy Bypass -Scope Process -Force; <span style="color: #51afef;">[</span>System.Net.ServicePointManager<span style="color: #51afef;">]</span>::SecurityProtocol = <span style="color: #51afef;">[</span>System.Net.ServicePointManager<span style="color: #51afef;">]</span>::SecurityProtocol -bor <span style="color: #da8548; font-weight: bold;">3072</span>; iex <span style="color: #51afef;">(</span><span style="color: #c678dd;">(</span>New-Object System.Net.WebClient<span style="color: #c678dd;">)</span>.DownloadString<span style="color: #c678dd;">(</span><span style="color: #98be65;">'https://community.chocolatey.org/install.ps1'</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>

<p>
You just need to run this command on your server, please have in mind that prior to this command you need to install chocolatey package manager on your server:
,#+BEGIN_SRC shell
choco install mongodb &#x2013;pre
#+END_SRC
</p>

<p>
You can provide other parameters such as:
</p>
<ol class="org-ol">
<li>/dataPath: - where MongoDB stores its database files - defaults to &ldquo;$env:ProgramData\MongoDB\data\db&rdquo;</li>
<li>/logPath: - where MongoDB stores its logs - defaults to &ldquo;$env:ProgramData\MongoDBlog&rdquo;</li>
</ol>
</div>
</div>

<div id="outline-container-orgfa36cb9" class="outline-4">
<h4 id="orgfa36cb9"><span class="section-number-4">1.2.2.</span> Centos 8</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
You can find a rather verbose documentation on this website:
</p>
<ul class="org-ul">
<li><a href="https://docs.mongodb.com/manual/tutorial/install-mongodb-on-red-hat/">https://docs.mongodb.com/manual/tutorial/install-mongodb-on-red-hat/</a></li>
</ul>
<p>
But these notes are less verbose and easier to follow if you are a experienced system admin.
</p>
</div>
<ol class="org-ol">
<li><a id="orga6cd84d"></a>Configure package manager<br />
<div class="outline-text-5" id="text-1-2-2-1">
<p>
Before anything you need to add mongo&rsquo;s repository so that yum can install mongodb:
Use your favorite command-line text editor to create a file in this path:
</p>
<ul class="org-ul">
<li>/etc/yum.repos.d/mongodb-org-5.0.repo</li>
</ul>
<p>
And paste this yaml file:
</p>
<div class="org-src-container">
<pre class="src src-yaml">[mongodb-org-5.0]
name=MongoDB Repository
baseurl=https://repo.mongodb.org/yum/redhat/$releasever/mongodb-org/5.0/x86_64/
gpgcheck=1
enabled=1
gpgkey=https://www.mongodb.org/static/pgp/server-5.0.asc
</pre>
</div>
</div>
</li>

<li><a id="org1095145"></a>Install the package<br />
<div class="outline-text-5" id="text-1-2-2-2">
<p>
Now you just need to run the command below and you are good to go:
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #ECBE7B;">sudo</span> yum install -y mongodb-org
<span style="color: #5B6268;">#</span><span style="color: #5B6268;">Or for installing a specific version</span>
<span style="color: #ECBE7B;">sudo</span> yum install -y mongodb-org-5.0.2 mongodb-org-database-5.0.2 mongodb-org-server-5.0.2 mongodb-org-shell-5.0.2 mongodb-org-mongos-5.0.2 mongodb-org-tools-5.0.2
</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-org20cbf50" class="outline-4">
<h4 id="org20cbf50"><span class="section-number-4">1.2.3.</span> Ubuntu 20.04</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
You can find a detailed blog post by digital ocean in the link below:
</p>
<ul class="org-ul">
<li><a href="https://www.digitalocean.com/community/tutorials/how-to-install-mongodb-on-ubuntu-20-04">https://www.digitalocean.com/community/tutorials/how-to-install-mongodb-on-ubuntu-20-04</a></li>
</ul>
<p>
Or even mongo&rsquo;s documentation:
</p>
<ul class="org-ul">
<li><a href="https://docs.mongodb.com/manual/tutorial/install-mongodb-on-ubuntu/">https://docs.mongodb.com/manual/tutorial/install-mongodb-on-ubuntu/</a></li>
</ul>
</div>
<ol class="org-ol">
<li><a id="org92e53e7"></a>Configure package manager<br />
<div class="outline-text-5" id="text-1-2-3-1">
<p>
We need to add mongo&rsquo;s repository to apt&rsquo;s configuration, as apt requires packages to be signed to prevent man-in-the-middle attack we need to import mongo&rsquo;s keys, for doing so we need to type the command below in our terminal:
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #ECBE7B;">curl</span> -fsSL https://www.mongodb.org/static/pgp/server-4.4.asc | <span style="color: #ECBE7B;">sudo</span> apt-key add -
</pre>
</div>
<p>
OK
Now we can add mongo&rsquo;s repository:
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #ECBE7B;">echo</span> <span style="color: #98be65;">"deb [ arch=amd64,arm64 ] https://repo.mongodb.org/apt/ubuntu focal/mongodb-org/4.4 multiverse"</span> | <span style="color: #ECBE7B;">sudo</span> tee /etc/apt/sources.list.d/mongodb-org-4.4.list
</pre>
</div>
<p>
After updating apt&rsquo;s db we can safely install mongodb package on our server:
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #ECBE7B;">sudo</span> apt update
<span style="color: #ECBE7B;">sudo</span> apt install mongodb-org
</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-orgc00649e" class="outline-4">
<h4 id="orgc00649e"><span class="section-number-4">1.2.4.</span> Starting mongo&rsquo;s service (Ubuntu and Centos)</h4>
<div class="outline-text-4" id="text-1-2-4">
<p>
As far as I know mongo can be handled by any INIT system such as systemd, runit, openrc, init.d. But as we all know, systemd this &ldquo;GOOD DEVIL&rdquo; is the most popular and every distro is using it; that&rsquo;s why I will only explain starting mongodb service using systemd:
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #5B6268;">#</span><span style="color: #5B6268;">TO START</span>
<span style="color: #ECBE7B;">sudo</span> systemctl start mongod
<span style="color: #5B6268;">#</span><span style="color: #5B6268;">TO START AND ENABLE AUTOSTART</span>
<span style="color: #ECBE7B;">sudo</span> systemctl enable --now mongod
<span style="color: #5B6268;">#</span><span style="color: #5B6268;">TO STOP</span>
<span style="color: #ECBE7B;">sudo</span> systemctl stop mongod
<span style="color: #5B6268;">#</span><span style="color: #5B6268;">TO RESTART</span>
<span style="color: #ECBE7B;">sudo</span> systemctl restart mongod
<span style="color: #5B6268;">#</span><span style="color: #5B6268;">TO DISABLE AUTOSTART</span>
<span style="color: #ECBE7B;">sudo</span> systemctl disable mongod
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org8952888" class="outline-3">
<h3 id="org8952888"><span class="section-number-3">1.3.</span> How to automate this process?</h3>
<div class="outline-text-3" id="text-1-3">
<ol class="org-ol">
<li>Ansible : <a href="https://galaxy.ansible.com/community/mongodb">https://galaxy.ansible.com/community/mongodb</a></li>
<li>Puppet : <a href="https://forge.puppet.com/modules/puppet/mongodb">https://forge.puppet.com/modules/puppet/mongodb</a></li>
<li>Chef : <a href="https://supermarket.chef.io/cookbooks/mongodb">https://supermarket.chef.io/cookbooks/mongodb</a></li>
</ol>
</div>
</div>

<div id="outline-container-orgbe00bf7" class="outline-3">
<h3 id="orgbe00bf7"><span class="section-number-3">1.4.</span> How to setup or database?</h3>
<div class="outline-text-3" id="text-1-4">
<p>
If we successfully install mongodb on our server, we will have access to mongo cli tool, using that we can do all kind of stuff with our database :).
Before moving on issue this command to get mongodb&rsquo;s interactive command line:
</p>
<div class="org-src-container">
<pre class="src src-shell">$ mongo
MongoDB shell version v4.4.10
connecting to: mongodb://127.0.0.1:27017/?<span style="color: #dcaeea;">compressors</span>=disabled&amp;<span style="color: #dcaeea;">gssapiServiceName</span>=mongodb
Implicit session: session <span style="color: #51afef;">{</span> <span style="color: #98be65;">"id"</span> : UUID<span style="color: #c678dd;">(</span><span style="color: #98be65;">"66ed5c8d-e780-47d9-822e-c747a35870cd"</span><span style="color: #c678dd;">)</span> <span style="color: #51afef;">}</span>
MongoDB server version: 4.4.10
&gt;
</pre>
</div>
</div>
<div id="outline-container-orgd63a031" class="outline-4">
<h4 id="orgd63a031"><span class="section-number-4">1.4.1.</span> Creating a new user with admin access</h4>
<div class="outline-text-4" id="text-1-4-1">
<ol class="org-ol">
<li>Creating an admin user for any database:</li>
</ol>
<div class="org-src-container">
<pre class="src src-js">use admin
db.createUser({
    user: <span style="color: #98be65;">"mongoadmin"</span>,
    pwd: <span style="color: #98be65;">"mongoadmin"</span>,
    roles: [
        <span style="color: #98be65;">"userAdminAnyDatabase"</span>,
        <span style="color: #98be65;">"dbAdminAnyDatabase"</span>,
        <span style="color: #98be65;">"readWriteAnyDatabase"</span>
    ]
})
</pre>
</div>
<ol class="org-ol">
<li>Creating user for different databases with different roles:</li>
</ol>
<div class="org-src-container">
<pre class="src src-js">use admin
db.createUser({
    user:<span style="color: #98be65;">"replSetManager"</span>,
    pwd:<span style="color: #98be65;">"password"</span>,
    roles:[
        {
            role:<span style="color: #98be65;">"clusterManager"</span>,
            db:<span style="color: #98be65;">"admin"</span>
        },
        {
            role:<span style="color: #98be65;">"dbOwner"</span>,
            db:<span style="color: #98be65;">"adminsblog"</span>
        },
        {
            role:<span style="color: #98be65;">"readWrite"</span>,
            db:<span style="color: #98be65;">"departmentblog"</span>
        },
        {
            role:<span style="color: #98be65;">"read"</span>,
            db:<span style="color: #98be65;">"otherblog"</span>
        }
    ]
})
</pre>
</div>
<ol class="org-ol">
<li>Enabling authorization (OPTIONAL)</li>
</ol>
<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #5B6268;">#</span><span style="color: #5B6268;">open /etc/mongod.conf with your favorite text editor and add this section:</span>
<span style="color: #dcaeea;">security</span>:
  <span style="color: #dcaeea;">authorization</span>: enabled
</pre>
</div>
</div>
</div>
<div id="outline-container-org6e3e2ac" class="outline-4">
<h4 id="org6e3e2ac"><span class="section-number-4">1.4.2.</span> Creating a new database</h4>
<div class="outline-text-4" id="text-1-4-2">
<p>
There are to steps to it:
</p>
<ol class="org-ol">
<li>Telling mongodb name of the database</li>
<li>Insert something to this database</li>
</ol>
<div class="org-src-container">
<pre class="src src-js">use myBrandNewDB
db.dummy.insert({
    name: <span style="color: #98be65;">"Ada Lovelace"</span>,
    age: <span style="color: #da8548; font-weight: bold;">205</span>
})
</pre>
</div>
</div>
</div>
<div id="outline-container-orgdc9e1e4" class="outline-4">
<h4 id="orgdc9e1e4"><span class="section-number-4">1.4.3.</span> Connecting to our database</h4>
<div class="outline-text-4" id="text-1-4-3">
<p>
We can use mongouri for that matter, the overall format of it is:
</p>
<ul class="org-ul">
<li>mongodb://[user]:[pass]@[server address]:[port]/[database name]</li>
</ul>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Tooraj Taraz</p>
<p class="date">Created: 2021-11-03 Wed 08:57</p>
</div>
</body>
</html>
